AntonBronnfjell/project-esp32-embedsyst-cpp_ble-jammer-nrf24l01/main/jammer_main.cpp
/**
 * ESP32-S3 Bluetooth Jammer — Dual NRF24L01+PA+LNA + ESP32 WiFi TX
 * Based on: RF-Clown, ESPnRF24-Jammer, Bruce firmware, and MyJammer
 * FOR EDUCATIONAL AND RESEARCH PURPOSES ONLY
 *
 * WARNING: Use of RF jammers is illegal in most countries.
 * This code is for understanding RF communications and
 * testing your own equipment's vulnerability ONLY.
 *
 * Three transmitters:
 *   NRF24 #1 — CW (continuous wave) with 130 µs PLL dwell per hop
 *   NRF24 #2 — CW (continuous wave) with 130 µs PLL dwell per hop
 *   ESP32 WiFi TX — 20 MHz wideband raw beacon frames on ch 1/6/11
 */

#include <cstdio>
#include <cstring>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_system.h"
#include "nvs_flash.h"
#include "esp_wifi.h"
#include "esp_wifi_types.h"
#include "esp_event.h"
#include "esp_netif.h"
#include "esp_rom_sys.h"
#include "driver/gpio.h"
#include "driver/rmt_tx.h"
#include "driver/rmt_encoder.h"
#include "led_strip_encoder.h"
#include "RF24.h"
#include "nRF24L01.h"

// NimBLE — used for BLE device discovery scan at startup
#include "nimble/nimble_port.h"
#include "nimble/nimble_port_freertos.h"
#include "host/ble_hs.h"
#include "host/ble_gap.h"
#include "host/util/util.h"
#include "services/gap/ble_svc_gap.h"

// WiFi raw TX as 3rd wideband transmitter (20 MHz bandwidth >> nRF24's 2 MHz)
static void init_wifi_jammer(void);
static void wifi_jam_task(void* arg);

// BLE device discovery (runs once at startup, before jamming)
static void ble_discovery_scan(void);

// Beacon frame: 20 MHz wideband energy on the selected WiFi channel
static const uint8_t s_beacon_frame[] = {
    0x80, 0x00,                                     // Frame Control: Beacon
    0x00, 0x00,                                     // Duration
    0xff, 0xff, 0xff, 0xff, 0xff, 0xff,             // DA: Broadcast
    0xaa, 0xbb, 0xcc, 0xdd, 0xee, 0xff,             // SA
    0xaa, 0xbb, 0xcc, 0xdd, 0xee, 0xff,             // BSSID
    0x00, 0x00,                                     // Sequence
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, // Timestamp
    0x64, 0x00,                                     // Beacon interval
    0x31, 0x04,                                     // Capabilities
    0x00, 0x01, 'X',                                // SSID (1 byte — minimal)
};

static const char* TAG = "JAMMER";

// ANSI colors for serial monitor (works in most terminals; disable if not supported)
#define C_OFF   "\033[0m"
#define C_RED   "\033[1;31m"
#define C_GRN   "\033[1;32m"
#define C_YEL   "\033[1;33m"
#define C_BLU   "\033[1;34m"
#define C_MAG   "\033[1;35m"
#define C_CYN   "\033[1;36m"
#define C_DIM   "\033[90m"
#define C_BOLD  "\033[1m"

// Category log macros: [INIT] [RF1] [RF2] [BTN] [MODE] [JAM] [BLE] [LED]
#define LOG_INIT(fmt, ...)  ESP_LOGI(TAG, C_CYN "[INIT]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_RF1(fmt, ...)   ESP_LOGI(TAG, C_GRN "[RF1]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_RF2(fmt, ...)   ESP_LOGI(TAG, C_BLU "[RF2]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_BTN(fmt, ...)   ESP_LOGI(TAG, C_YEL "[BTN]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_MODE(fmt, ...)  ESP_LOGI(TAG, C_MAG "[MODE]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_JAM(fmt, ...)   ESP_LOGI(TAG, C_GRN "[JAM]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_JAM_OFF(fmt, ...) ESP_LOGI(TAG, C_RED "[JAM]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_BLE(fmt, ...)   ESP_LOGI(TAG, C_CYN "[BLE]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_ERR(fmt, ...)   ESP_LOGE(TAG, C_RED "[ERR]" C_OFF " " fmt, ##__VA_ARGS__)
#define LOG_WRN(fmt, ...)   ESP_LOGW(TAG, C_YEL "[WRN]" C_OFF " " fmt, ##__VA_ARGS__)

// Last button press duration (ms), set by check_button_event; 0 if not a press
static uint32_t s_last_press_duration_ms = 0;

// Lower this (e.g. 1_000_000) if SPI probe shows garbage but wiring looks correct (long wires / breadboard).
#define JAMMER_NRF24_SPI_HZ 10000000

// ============== ESP32-S3 PIN CONFIGURATION ==============
// NOTE: ESP32-S3 has NO GPIO 22, 23, 24, 25 (only 0-21 and 26-48).
// Pins below are valid for ESP32-S3 and typical Lonely Binary N16R8 / DevKitC headers.
//
// First NRF24L01 Module (HSPI)
#define CE_PIN_1    16
#define CSN_PIN_1   15
#define SCK_PIN_1   14
#define MOSI_PIN_1  13
#define MISO_PIN_1  12

// Second NRF24L01 Module (VSPI) - uses GPIOs that exist on ESP32-S3
#define CE_PIN_2    17
#define CSN_PIN_2    18
#define SCK_PIN_2    21
#define MOSI_PIN_2   47
#define MISO_PIN_2   39

// Mode button (change if your board doesn't break out this pin; e.g. 34, 35, 36, 38, 48)
#define BUTTON_PIN  35

// Lonely Binary ESP32-S3 2520V5 N16R8: built-in WS2812 RGB LED on GPIO 48
#define WS2812_GPIO     48
#define RMT_RESOLUTION  10000000
#define LED_BREATH_STEP_MS  15  // delay per brightness step in breathing animation

// ============== JAMMER CONFIGURATION ==============
#define MIN_CHANNEL   0
#define MAX_CHANNEL  79
// ============== GLOBAL VARIABLES ==============
SPI spi0(SPI2_HOST);
SPI spi1(SPI3_HOST);

RF24 radio1(CE_PIN_1, CSN_PIN_1);
RF24 radio2(CE_PIN_2, CSN_PIN_2);

static uint32_t xor_state = 0xDEADBEEF;

static inline uint32_t xorshift32(void) {
    xor_state ^= xor_state << 13;
    xor_state ^= xor_state >> 17;
    xor_state ^= xor_state << 5;
    return xor_state;
}

static inline uint8_t rand_channel(void) {
    return (uint8_t)(xorshift32() % (MAX_CHANNEL + 1));
}

enum JammerMode {
    MODE_BARRAGE,           // LED: slow rainbow    | random hop all 80 ch
    MODE_BLE_ADV_BARRAGE,   // LED: cyan breath     | R1=adv ctrl + R2=random data
    MODE_TRACKING,          // LED: white breath     | concentrated 10-ch window sweep
    MODE_BT_CLASSIC,        // LED: blue breath     | sequential sweep ch 2-80
    MODE_BLE_ALL,           // LED: green breath    | all 40 BLE channels
    MODE_BLE_ADV,           // LED: yellow breath   | ch 2,26,80 rapid cycle
    MODE_BLE_SIEGE,         // LED: orange breath   | random across all 40 BLE ch (data+adv)
    MODE_CONSTANT_CARRIER,  // LED: red breath      | CW on ch 45 (baseline test)
    MODE_COUNT
};

static volatile JammerMode currentMode = MODE_BARRAGE;
static volatile bool s_mode_changed = false;
static uint8_t sweep_ch1 = 2;
static uint8_t sweep_ch2 = 41;
static bool sweep_dir1 = true;
static bool sweep_dir2 = true;
static uint8_t ble_idx1 = 0;
static uint8_t ble_idx2 = 20;
static uint8_t ble_adv_idx = 0;
static uint8_t tracking_cycle = 0;

static volatile bool s_jamming_active = false;

// Button state: short press = toggle jamming, long press = cycle mode
static int lastButtonState = 1;
static uint32_t pressStartTime = 0;  // 0 = not in a press
static rmt_channel_handle_t s_rmt_chan = nullptr;
static rmt_encoder_handle_t s_led_encoder = nullptr;
#define DEBOUNCE_MS   50
#define LONG_PRESS_MS 800

// ============== FUNCTION PROTOTYPES ==============
static void init_nrf24_modules(void);
static void log_nrf24_spi_probe(const char* bus_name, SPI& spi);
static void configure_radio_for_tx(RF24& radio);
static void hop_carrier(RF24& radio, uint8_t channel);
static void jam_barrage(void);
static void jam_ble_adv_barrage(void);
static void jam_tracking(void);
static void jam_bt_classic(void);
static void jam_ble_all(void);
static void jam_ble_adv(void);
static void jam_ble_siege(void);
static void jam_constant_carrier(void);
static void print_mode(void);
static void switch_mode(void);
static int check_button_event(void);
static void stop_jamming_radios(void);
static void init_rgb_led(void);
static void rainbow_led_task(void* arg);
static void jam_task(void* arg);

// ============== ENTRY POINT ==============
extern "C" void app_main(void)
{
    LOG_INIT("=== ESP32-S3 Bluetooth Jammer ===");
    LOG_INIT("FOR EDUCATIONAL USE ONLY");

    LOG_INIT("NVS flash...");
    esp_err_t ret = nvs_flash_init();
    if (ret == ESP_ERR_NVS_NO_FREE_PAGES || ret == ESP_ERR_NVS_NEW_VERSION_FOUND) {
        ESP_ERROR_CHECK(nvs_flash_erase());
        ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    LOG_INIT("WiFi raw TX (3rd transmitter, 20 MHz wideband)...");
    init_wifi_jammer();

