AntonBronnfjell/project-esp32-embedsyst-cpp_ble-jammer-nrf24l01/main/jammer_main.cpp
    LOG_INIT("BLE device discovery (startup scan)...");
    ble_discovery_scan();

    LOG_INIT("Button GPIO %d (short=toggle jam, long=cycle mode)", BUTTON_PIN);
    gpio_config_t io = {};
    io.pin_bit_mask = (1ULL << BUTTON_PIN);
    io.mode = GPIO_MODE_INPUT;
    io.pull_up_en = GPIO_PULLUP_ENABLE;
    io.pull_down_en = GPIO_PULLDOWN_DISABLE;
    io.intr_type = GPIO_INTR_DISABLE;
    gpio_config(&io);

    LOG_INIT("NRF24 modules (HSPI + VSPI)...");
    init_nrf24_modules();

    LOG_INIT("RGB LED (WS2812 GPIO %d)", WS2812_GPIO);
    init_rgb_led();
    xTaskCreate(rainbow_led_task, "rainbow", 2048, NULL, 3, NULL);

    LOG_INIT("Setup complete. Short-press = start/stop jamming. Long-press = change mode.");
    print_mode();

    xTaskCreatePinnedToCore(jam_task, "jam", 4096, NULL, configMAX_PRIORITIES - 1, NULL, 1);

    while (1) {
        int ev = check_button_event();
        if (ev == 1) {
            LOG_BTN("Short press (%u ms) -> toggle jamming", (unsigned)s_last_press_duration_ms);
            s_jamming_active = !s_jamming_active;
            if (s_jamming_active) LOG_JAM("ON");
            else                  LOG_JAM_OFF("OFF");
        } else if (ev == 2) {
            LOG_BTN("Long press (%u ms) -> cycle mode", (unsigned)s_last_press_duration_ms);
            switch_mode();
        }
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}

// ============== HELPERS ==============
// Returns 0 = no event, 1 = short press (toggle jamming), 2 = long press (cycle mode)
static int check_button_event(void)
{
    int reading = gpio_get_level((gpio_num_t)BUTTON_PIN);
    uint32_t now = (uint32_t)(esp_timer_get_time() / 1000);

    if (reading == 0) {  // pressed
        if (lastButtonState == 1 && pressStartTime == 0)
            pressStartTime = now;
        lastButtonState = 0;
        return 0;
    }
    // released
    if (lastButtonState == 0 && pressStartTime != 0) {
        uint32_t duration = now - pressStartTime;
        s_last_press_duration_ms = duration;
        pressStartTime = 0;
        lastButtonState = 1;
        if (duration >= DEBOUNCE_MS)
            return duration >= LONG_PRESS_MS ? 2 : 1;
    }
    s_last_press_duration_ms = 0;
    lastButtonState = 1;
    pressStartTime = 0;
    return 0;
}

static void stop_jamming_radios(void)
{
    radio1.powerDown();
    radio2.powerDown();
}

// ---------- Built-in RGB LED: rainbow only while jamming is active ----------
static void hsv_to_rgb(uint32_t h, uint8_t s, uint8_t v, uint8_t* r, uint8_t* g, uint8_t* b)
{
    if (s == 0) {
        *r = *g = *b = v;
        return;
    }
    uint32_t region = h / 60;
    uint32_t remainder = (h % 60) * 256 / 60;
    uint32_t p = (v * (255 - s)) / 255;
    uint32_t q = (v * (255 - (s * remainder) / 256)) / 255;
    uint32_t t = (v * (255 - (s * (256 - remainder)) / 256)) / 255;
    switch (region) {
        case 0:  *r = (uint8_t)v; *g = (uint8_t)t; *b = (uint8_t)p; break;
        case 1:  *r = (uint8_t)q; *g = (uint8_t)v; *b = (uint8_t)p; break;
        case 2:  *r = (uint8_t)p; *g = (uint8_t)v; *b = (uint8_t)t; break;
        case 3:  *r = (uint8_t)p; *g = (uint8_t)q; *b = (uint8_t)v; break;
        case 4:  *r = (uint8_t)t; *g = (uint8_t)p; *b = (uint8_t)v; break;
        default: *r = (uint8_t)v; *g = (uint8_t)p; *b = (uint8_t)q; break;
    }
}

static void set_rgb_led(uint8_t r, uint8_t g, uint8_t b)
{
    if (!s_rmt_chan || !s_led_encoder) return;
    uint8_t grb[3] = { g, r, b };  // WS2812 order
    rmt_transmit_config_t tx_config = {};
    tx_config.loop_count = 0;
    ESP_ERROR_CHECK(rmt_transmit(s_rmt_chan, s_led_encoder, grb, sizeof(grb), &tx_config));
    ESP_ERROR_CHECK(rmt_tx_wait_all_done(s_rmt_chan, portMAX_DELAY));
}

static void init_rgb_led(void)
{
    rmt_tx_channel_config_t tx_cfg = {};
    tx_cfg.clk_src = RMT_CLK_SRC_DEFAULT;
    tx_cfg.gpio_num = (gpio_num_t)WS2812_GPIO;
    tx_cfg.mem_block_symbols = 64;
    tx_cfg.resolution_hz = RMT_RESOLUTION;
    tx_cfg.trans_queue_depth = 1;
    ESP_ERROR_CHECK(rmt_new_tx_channel(&tx_cfg, &s_rmt_chan));
    led_strip_encoder_config_t enc_cfg = {};
    enc_cfg.resolution = RMT_RESOLUTION;
    ESP_ERROR_CHECK(rmt_new_led_strip_encoder(&enc_cfg, &s_led_encoder));
    ESP_ERROR_CHECK(rmt_enable(s_rmt_chan));
    set_rgb_led(0, 0, 0);
}

// Per-mode LED color (R, G, B at full brightness).
// BARRAGE uses rainbow (hue cycling), all others use a fixed color with breathing.
static void get_mode_color(JammerMode mode, uint8_t *r, uint8_t *g, uint8_t *b)
{
    switch (mode) {
        case MODE_BLE_ADV_BARRAGE:  *r =   0; *g = 200; *b = 200; break; // cyan
        case MODE_TRACKING:         *r = 200; *g = 200; *b = 200; break; // white
        case MODE_BT_CLASSIC:       *r =   0; *g =   0; *b = 200; break; // blue
        case MODE_BLE_ALL:          *r =   0; *g = 200; *b =   0; break; // green
        case MODE_BLE_ADV:          *r = 200; *g = 200; *b =   0; break; // yellow
        case MODE_BLE_SIEGE:        *r = 200; *g = 100; *b =   0; break; // orange
        case MODE_CONSTANT_CARRIER: *r = 200; *g =   0; *b =   0; break; // red
        default:                    *r = 200; *g = 200; *b = 200; break; // white fallback
    }
}

static void rainbow_led_task(void* arg)
{
    (void)arg;
    uint32_t hue = 0;
    uint8_t breath = 0;
    bool breath_up = true;

    for (;;) {
        if (!s_jamming_active) {
            set_rgb_led(0, 0, 0);
            vTaskDelay(pdMS_TO_TICKS(50));
            breath = 0;
            breath_up = true;
            continue;
        }

        if (currentMode == MODE_BARRAGE) {
            // Slow rainbow cycle for barrage
            uint8_t r, g, b;
            hsv_to_rgb(hue % 360, 255, 180, &r, &g, &b);
            set_rgb_led(r, g, b);
            hue += 2;
            vTaskDelay(pdMS_TO_TICKS(60));
        } else {
            // Breathing animation: brightness ramps 0 → 200 → 0
            uint8_t base_r, base_g, base_b;
            get_mode_color(currentMode, &base_r, &base_g, &base_b);

            uint8_t r = (uint8_t)((uint16_t)base_r * breath / 200);
            uint8_t g = (uint8_t)((uint16_t)base_g * breath / 200);
            uint8_t b = (uint8_t)((uint16_t)base_b * breath / 200);
            set_rgb_led(r, g, b);

            if (breath_up) {
                if (breath >= 200) breath_up = false;
                else               breath += 2;
            } else {
                if (breath <= 2)   breath_up = true;
                else               breath -= 2;
            }
            vTaskDelay(pdMS_TO_TICKS(LED_BREATH_STEP_MS));
        }
    }
}

// ---------- WiFi raw TX: 3rd transmitter using ESP32's built-in 2.4 GHz radio ----------
// Each WiFi channel is 20 MHz wide — covers ~20 Bluetooth channels at once.
// WiFi ch 1 = 2412 MHz (BT ch 12), ch 6 = 2437 MHz (BT ch 37), ch 11 = 2462 MHz (BT ch 62)

static void init_wifi_jammer(void)
{
    ESP_ERROR_CHECK(esp_event_loop_create_default());
    ESP_ERROR_CHECK(esp_netif_init());

