AntonBronnfjell/project-esp32-embedsyst-cpp_ble-jammer-nrf24l01/main/jammer_main.cpp
    wifi_init_config_t cfg = WIFI_INIT_CONFIG_DEFAULT();
    ESP_ERROR_CHECK(esp_wifi_init(&cfg));
    ESP_ERROR_CHECK(esp_wifi_set_storage(WIFI_STORAGE_RAM));
    ESP_ERROR_CHECK(esp_wifi_set_mode(WIFI_MODE_STA));
    ESP_ERROR_CHECK(esp_wifi_start());
    ESP_ERROR_CHECK(esp_wifi_set_channel(1, WIFI_SECOND_CHAN_NONE));
    esp_wifi_set_max_tx_power(80);

    xTaskCreatePinnedToCore(wifi_jam_task, "wifi_jam", 4096, NULL, 5, NULL, 0);
    LOG_INIT("WiFi raw TX started (3rd transmitter, built-in antenna)");
}

static void wifi_jam_task(void* arg)
{
    (void)arg;
    static const uint8_t wifi_channels[] = { 1, 6, 11 };
    uint8_t ch_idx = 0;
    uint32_t pkt_count = 0;

    for (;;) {
        if (!s_jamming_active) {
            vTaskDelay(pdMS_TO_TICKS(50));
            continue;
        }

        esp_wifi_80211_tx(WIFI_IF_STA, s_beacon_frame, sizeof(s_beacon_frame), false);

        if (++pkt_count >= 50) {
            pkt_count = 0;
            ch_idx = (ch_idx + 1) % 3;
            esp_wifi_set_channel(wifi_channels[ch_idx], WIFI_SECOND_CHAN_NONE);
        }

        vTaskDelay(1);
    }
}

// ---------- BLE device discovery: one-shot scan at startup ----------

static volatile bool s_ble_scan_done = false;
static volatile bool s_ble_synced = false;

static int ble_disc_gap_event(struct ble_gap_event *event, void *arg)
{
    (void)arg;
    if (event->type == BLE_GAP_EVENT_DISC) {
        const struct ble_gap_disc_desc *desc = &event->disc;
        char addr_str[18];
        snprintf(addr_str, sizeof(addr_str), "%02X:%02X:%02X:%02X:%02X:%02X",
                 desc->addr.val[5], desc->addr.val[4], desc->addr.val[3],
                 desc->addr.val[2], desc->addr.val[1], desc->addr.val[0]);

        const char *name = "(unknown)";
        char name_buf[32] = {0};
        struct ble_hs_adv_fields fields;
        if (ble_hs_adv_parse_fields(&fields, desc->data, desc->length_data) == 0
            && fields.name != NULL && fields.name_len > 0) {
            uint8_t copy_len = fields.name_len < sizeof(name_buf) - 1
                             ? fields.name_len : (uint8_t)(sizeof(name_buf) - 1);
            memcpy(name_buf, fields.name, copy_len);
            name_buf[copy_len] = '\0';
            name = name_buf;
        }

        LOG_BLE("FOUND  %s  rssi=%d  name=\"%s\"", addr_str, (int)desc->rssi, name);
    } else if (event->type == BLE_GAP_EVENT_DISC_COMPLETE) {
        s_ble_scan_done = true;
    }
    return 0;
}

static void ble_disc_on_sync(void)
{
    ble_hs_util_ensure_addr(0);
    s_ble_synced = true;
}

static void ble_disc_on_reset(int reason)
{
    (void)reason;
    s_ble_synced = false;
}

static void ble_disc_host_task(void *param)
{
    (void)param;
    nimble_port_run();
    vTaskDelete(NULL);
}

static void ble_discovery_scan(void)
{
    esp_log_level_set("NimBLE", ESP_LOG_WARN);

    esp_err_t ret = nimble_port_init();
    if (ret != ESP_OK) {
        LOG_WRN("NimBLE init failed (%s) — skipping BLE discovery", esp_err_to_name(ret));
        return;
    }

    ble_hs_cfg.reset_cb = ble_disc_on_reset;
    ble_hs_cfg.sync_cb  = ble_disc_on_sync;
    ble_svc_gap_init();
    ble_svc_gap_device_name_set("scanner");

    nimble_port_freertos_init(ble_disc_host_task);

    for (int i = 0; i < 40 && !s_ble_synced; i++)
        vTaskDelay(pdMS_TO_TICKS(50));

    if (!s_ble_synced) {
        LOG_WRN("NimBLE did not sync — skipping BLE discovery");
        nimble_port_stop();
        nimble_port_deinit();
        return;
    }

    LOG_BLE("Scanning for nearby BLE devices (3 seconds)...");

    struct ble_gap_disc_params scan_params = {};
    scan_params.passive = 1;
    scan_params.itvl = 0x0010;
    scan_params.window = 0x0010;
    scan_params.filter_duplicates = 1;

    s_ble_scan_done = false;
    int rc = ble_gap_disc(BLE_OWN_ADDR_PUBLIC, 3000, &scan_params,
                          ble_disc_gap_event, NULL);
    if (rc != 0) {
        LOG_WRN("BLE scan start failed (rc=%d)", rc);
    } else {
        while (!s_ble_scan_done)
            vTaskDelay(pdMS_TO_TICKS(100));
    }

    LOG_BLE("Discovery complete.");
    nimble_port_stop();
    nimble_port_deinit();
}

static void log_nrf24_spi_probe(const char* bus_name, SPI& spi)
{
    uint8_t st_aw = 0, aw = 0;
    uint8_t st_cfg = 0, cfg = 0;
    if (!spi.readNrf24Register(SETUP_AW, &st_aw, &aw)) {
        LOG_WRN("%s SPI probe: bus not initialized", bus_name);
        return;
    }
    (void)spi.readNrf24Register(NRF_CONFIG, &st_cfg, &cfg);
    LOG_WRN("%s SPI probe: SETUP_AW=0x%02x (status=0x%02x) CONFIG=0x%02x (status=0x%02x)",
            bus_name, (unsigned)aw, (unsigned)st_aw, (unsigned)cfg, (unsigned)st_cfg);
    LOG_WRN("%s If SETUP_AW is 0x03 and CONFIG ~0x08: chip likely OK (check CE/SPI speed). 0xFF/0x00: MISO floating or MOSI/SCK/CSN wrong, or no 3.3V/GND.",
            bus_name);
}

static void init_nrf24_modules(void)
{
    LOG_INIT("SPI0 (HSPI): SCK=%d MISO=%d MOSI=%d CSN=%d", SCK_PIN_1, MISO_PIN_1, MOSI_PIN_1, CSN_PIN_1);
    spi0.begin(SCK_PIN_1, MISO_PIN_1, MOSI_PIN_1, CSN_PIN_1, JAMMER_NRF24_SPI_HZ);
    LOG_INIT("SPI1 (VSPI): SCK=%d MISO=%d MOSI=%d CSN=%d", SCK_PIN_2, MISO_PIN_2, MOSI_PIN_2, CSN_PIN_2);
    spi1.begin(SCK_PIN_2, MISO_PIN_2, MOSI_PIN_2, CSN_PIN_2, JAMMER_NRF24_SPI_HZ);

    bool module1_ok = false;
    bool module2_ok = false;

    LOG_RF1("begin() CE=%d CSN=%d...", CE_PIN_1, CSN_PIN_1);
    if (radio1.begin(&spi0)) {
        vTaskDelay(pdMS_TO_TICKS(100));
        LOG_RF1("OK | connected=%s", radio1.isChipConnected() ? "yes" : "no");
        module1_ok = true;
    } else {
        LOG_ERR("RF1 (HSPI) begin FAILED - check wiring CE=%d CSN=%d", CE_PIN_1, CSN_PIN_1);
        log_nrf24_spi_probe("RF1", spi0);
    }

    LOG_RF2("begin() CE=%d CSN=%d...", CE_PIN_2, CSN_PIN_2);
    if (radio2.begin(&spi1)) {
        vTaskDelay(pdMS_TO_TICKS(100));
        LOG_RF2("OK | connected=%s", radio2.isChipConnected() ? "yes" : "no");
        module2_ok = true;
    } else {
        LOG_ERR("RF2 (VSPI) begin FAILED - check wiring CE=%d CSN=%d", CE_PIN_2, CSN_PIN_2);
        log_nrf24_spi_probe("RF2", spi1);
    }

    if (!module1_ok && !module2_ok) {
        LOG_ERR("No NRF24 modules. Button/BLE still work.");
        LOG_WRN("Hardware check: 3.3V on VCC, common GND, swap MISO/MOSI if probe is 0xFF/0x00; test module on a known-good Arduino+nRF24 sketch.");
        return;
    }

