AntonBronnfjell/project-esp32-embedsyst-cpp_ble-jammer-nrf24l01/main/jammer_main.cpp
    // ---- RF self-test: each radio transmits CW, the other scans RPD ----
    // RPD triggers at >= -64 dBm. PA+LNA modules vary in output; a FAIL here
    // may just mean the signal is marginal at the inter-module distance, not
    // that the radio is dead. If isChipConnected() returns true and registers
    // look correct, the module is almost certainly transmitting.
    if (module1_ok && module2_ok) {
        const uint8_t test_ch = 50;
        const int attempts = 3;
        const int dwell_ms = 20;
        LOG_INIT("=== RF SELF-TEST on ch %d (%d attempts, %d ms dwell) ===",
                 test_ch, attempts, dwell_ms);

        // Test 1: RF1 TX → RF2 RX
        bool rpd_r2 = false;
        for (int attempt = 0; attempt < attempts && !rpd_r2; attempt++) {
            radio1.begin(&spi0);
            radio2.begin(&spi1);
            vTaskDelay(pdMS_TO_TICKS(5));

            radio2.setChannel(test_ch);
            radio2.startListening();
            vTaskDelay(pdMS_TO_TICKS(2));

            radio1.stopListening();
            radio1.startConstCarrier(RF24_PA_MAX, test_ch);
            vTaskDelay(pdMS_TO_TICKS(dwell_ms));

            rpd_r2 = radio2.testRPD();
            radio1.stopConstCarrier();
            radio2.stopListening();

            if (!rpd_r2 && attempt < attempts - 1)
                vTaskDelay(pdMS_TO_TICKS(10));
        }

        if (rpd_r2)
            LOG_RF1("TX -> RF2 detected signal (RPD=1). RF1 IS transmitting.");
        else
            LOG_WRN("TX -> RF2: RPD=0 after %d attempts. RF1 signal below -64 dBm at module distance. "
                     "Likely OK if isChipConnected=yes — check antenna seating / PA module quality.",
                     attempts);

        // Test 2: RF2 TX → RF1 RX
        bool rpd_r1 = false;
        for (int attempt = 0; attempt < attempts && !rpd_r1; attempt++) {
            radio1.begin(&spi0);
            radio2.begin(&spi1);
            vTaskDelay(pdMS_TO_TICKS(5));

            radio1.setChannel(test_ch);
            radio1.startListening();
            vTaskDelay(pdMS_TO_TICKS(2));

            radio2.stopListening();
            radio2.startConstCarrier(RF24_PA_MAX, test_ch);
            vTaskDelay(pdMS_TO_TICKS(dwell_ms));

            rpd_r1 = radio1.testRPD();
            radio2.stopConstCarrier();
            radio1.stopListening();

            if (!rpd_r1 && attempt < attempts - 1)
                vTaskDelay(pdMS_TO_TICKS(10));
        }

        if (rpd_r1)
            LOG_RF2("TX -> RF1 detected signal (RPD=1). RF2 IS transmitting.");
        else
            LOG_WRN("TX -> RF1: RPD=0 after %d attempts. RF2 signal below -64 dBm at module distance. "
                     "Likely OK if isChipConnected=yes — check antenna seating / PA module quality.",
                     attempts);

        const char* r1_str = rpd_r2 ? "TX_OK" : "TX_WEAK";
        const char* r2_str = rpd_r1 ? "TX_OK" : "TX_WEAK";
        LOG_INIT("=== RF SELF-TEST done: RF1=%s RF2=%s (chip1=%s chip2=%s) ===",
                 r1_str, r2_str,
                 radio1.isChipConnected() ? "connected" : "DISCONNECTED",
                 radio2.isChipConnected() ? "connected" : "DISCONNECTED");
    }

    if (module1_ok) configure_radio_for_tx(radio1);
    if (module2_ok) configure_radio_for_tx(radio2);

    LOG_INIT("NRF24 CW config: AutoAck=OFF, PA=MAX, 2Mbps, CRC=OFF, 130us PLL dwell");
    if (module1_ok) { LOG_RF1("--- register dump ---"); radio1.printDetails(); }
    if (module2_ok) { LOG_RF2("--- register dump ---"); radio2.printDetails(); }

    s_jamming_active = true;
    LOG_JAM("ON at boot (BARRAGE). Short-press=stop, long-press=change mode.");
}

static void configure_radio_for_tx(RF24& radio)
{
    radio.powerUp();
    vTaskDelay(pdMS_TO_TICKS(5));
    radio.stopListening();
    radio.setAutoAck(false);
    radio.setRetries(0, 0);
    radio.setPALevel(RF24_PA_MAX, true);
    radio.setDataRate(RF24_2MBPS);
    radio.setCRCLength(RF24_CRC_DISABLED);
    radio.startConstCarrier(RF24_PA_MAX, 45);
}

// CW hop: just retune the PLL. CE stays HIGH from startConstCarrier() so the
// carrier never stops — 100% RF duty cycle. The 130 µs dwell lets the PLL
// lock on the new channel before we hop again.
static void hop_carrier(RF24& radio, uint8_t channel)
{
    radio.setChannel(channel);
    esp_rom_delay_us(130);
}

static void jam_task(void* arg)
{
    (void)arg;
    uint32_t status_count = 0;
    uint32_t yield_count = 0;
    bool was_active = false;

    for (;;) {
        if (!s_jamming_active) {
            if (was_active) {
                stop_jamming_radios();
                LOG_JAM_OFF("Radios powered down");
                was_active = false;
            }
            vTaskDelay(pdMS_TO_TICKS(50));
            status_count = 0;
            yield_count = 0;
            continue;
        }

        if (!was_active || s_mode_changed) {
            s_mode_changed = false;
            configure_radio_for_tx(radio1);
            configure_radio_for_tx(radio2);
            sweep_ch1 = 2;  sweep_ch2 = 41;
            sweep_dir1 = true; sweep_dir2 = true;
            ble_idx1 = 0; ble_idx2 = 20;
            ble_adv_idx = 0;
            tracking_cycle = 0;
            if (!was_active) {
                LOG_JAM("Radios active | R1=%s R2=%s",
                        radio1.isChipConnected() ? "ok" : "FAIL",
                        radio2.isChipConnected() ? "ok" : "FAIL");
            }
            was_active = true;
        }

        switch (currentMode) {
            case MODE_BARRAGE:          jam_barrage(); break;
            case MODE_BLE_ADV_BARRAGE:  jam_ble_adv_barrage(); break;
            case MODE_TRACKING:         jam_tracking(); break;
            case MODE_BT_CLASSIC:       jam_bt_classic(); break;
            case MODE_BLE_ALL:          jam_ble_all(); break;
            case MODE_BLE_ADV:          jam_ble_adv(); break;
            case MODE_BLE_SIEGE:        jam_ble_siege(); break;
            case MODE_CONSTANT_CARRIER: jam_constant_carrier(); break;
            default: break;
        }
        if (++status_count >= 50000) {
            status_count = 0;
            LOG_JAM("Status: active | mode=%d R1=%s R2=%s", (int)currentMode,
                    radio1.isChipConnected() ? "ok" : "FAIL",
                    radio2.isChipConnected() ? "ok" : "FAIL");
        }
        if (++yield_count >= 200) {
            yield_count = 0;
            vTaskDelay(1);
        }
    }
}

// MODE 0: BARRAGE — CW random hop across all 80 channels with 130 µs PLL dwell.
// Both radios independent random = max unpredictability for AFH.
// ~6600 hops/s per radio with CW always on (100% RF duty cycle).
static void jam_barrage(void)
{
    hop_carrier(radio1, rand_channel());
    hop_carrier(radio2, rand_channel());
}

// BLE advertising channels (shared by multiple modes)
// ch37=2402→nRF ch2, ch38=2426→nRF ch26, ch39=2480→nRF ch80
static const uint8_t ble_adv_channels[] = { 2, 26, 80 };

